#include <stdio.h>
#include <windows.h>
#include <conio.h>
#include <time.h>
#define TRUE 1

int i, j; // ÈæÀÇ x,y ÁÂÇ¥
int q, w; //¹éÀÇ x,y ÁÂÇ¥
int sec = 0;
int arr[15][15] = {
{1,2,2,2,2,2,2,2,2,2,2,2,2,2,3},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},        
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{4,0,0,0,0,0,0,0,0,0,0,0,0,0,5},
{6,7,7,7,7,7,7,7,7,7,7,7,7,7,8} };

void black_input(){
	scanf("%c %d", &j, &i); getchar();//ÈæÀÇ ÀÔ·Â 
}

void white_input(){
	scanf("%c %d", &q, &w); getchar();//¹éÀÇ ÀÔ·Â
}

int board(){ //¿À¸ñÆÇ ±¸¼º &»õ·Î°íÄ§ 
	system("cls");
	printf("   a b c d e f g h i j k l m n o\n");
	for(int i = 0; i<15; i++){ printf("%2d", i+1);
		for(int j=0; j < 15; j++){
			if(arr[i][j] == 0) printf("¦« ");
			else if(arr[i][j] == 1) printf("¦£ ");
			else if(arr[i][j] == 2) printf("¦¨ ");
			else if(arr[i][j] == 3) printf("¦¤ \n");
			else if(arr[i][j] == 4) printf("¦§ ");
			else if(arr[i][j] == 5) printf("¦© \n");
			else if(arr[i][j] == 6) printf("¦¦ ");
			else if(arr[i][j] == 7) printf("¦ª ");
			else if(arr[i][j] == 8) printf("¦¥ \n");
			else if(arr[i][j] == 10) printf("¡Ü");
			else if(arr[i][j] == 11) printf("¡Û");
			else if(arr[i][j] == 12) printf("¡Ü\n");
			else if(arr[i][j] == 13) printf("¡Û\n");
		}
	}
	printf("\n---------------------------------\n   ");
}

int main(){
	printf("    < Welcome to omok world >\n");
	printf("   a b c d e f g h i j k l m n o\n");
	printf(" 1¦£ ¦¨ ¦¨ ¦¨ ¦¨ ¦¨ ¦¨ ¦¨ ¦¨ ¦¨ ¦¨ ¦¨ ¦¨ ¦¨ ¦¤\n");
	printf(" 2¦§ ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦©\n"); 
	printf(" 3¦§ ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦©\n"); 
	printf(" 4¦§ ¦« ¦« ¡Ü¦« ¦« ¦« ¦« ¦« ¦« ¦« ¡Ü¦« ¦« ¦©\n"); 
	printf(" 5¦§ ¦« ¡Ü¦« ¡Ü¦« ¦« ¦« ¦« ¦« ¡Ü¦« ¡Ü¦« ¦©\n"); 
	printf(" 6¦§ ¡Ü¦« ¦« ¦« ¡Ü¦« ¦« ¦« ¡Ü¦« ¦« ¦« ¡Ü¦©\n"); 
	printf(" 7¦§ ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦©\n"); 
	printf(" 8¦§ ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦©\n"); 
	printf(" 9¦§ ¦« ¦« ¦« ¦« ¦« ¡Ü¡Ü¡Ü¦« ¦« ¦« ¦« ¦« ¦©\n"); 
	printf("10¦§ ¦« ¦« ¦« ¦« ¡Ü¦« ¦« ¦« ¡Ü¦« ¦« ¦« ¦« ¦©\n"); 
	printf("11¦§ ¦« ¦« ¦« ¦« ¡Ü¦« ¦« ¦« ¡Ü¦« ¦« ¦« ¦« ¦©\n"); 
	printf("12¦§ ¦« ¦« ¦« ¦« ¡Ü¦« ¦« ¦« ¡Ü¦« ¦« ¦« ¦« ¦©\n"); 
	printf("13¦§ ¦« ¦« ¦« ¦« ¦« ¡Ü¡Ü¡Ü¦« ¦« ¦« ¦« ¦« ¦©\n"); 
	printf("14¦§ ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦« ¦©\n"); 
	printf("15¦¦ ¦ª ¦ª ¦ª ¦ª ¦ª ¦ª ¦ª ¦ª ¦ª ¦ª ¦ª ¦ª ¦ª ¦¥\n"); 
	printf("\n---------------------------------\n   ");
	printf("1. µ¹Àº °ãÄ¥ ¼ö ¾ø¾î¿ä.\n   ");
	printf("2. 30ÃÊ ³»¿¡ µÖ¾ß ÇØ¿ä.\n   ");
	printf("3. \"a1\"°ú °°Àº Çü½ÄÀ¸·Î µÎ¼¼¿ä~\n  ");
	printf("   Press ENTER to start");
	getchar();
	while(1){ 
	black :
		int sec = 0;
		char key[20];
		while(TRUE){
			system("cls");
			board();
			printf("Time: %d\n", 30 - sec);
			printf("   black_input: ");
			sec++;
			Sleep(1000);
			if(sec == 30){
				printf("Time Over");
				Sleep(1500);
				goto white;//Â÷·Ê ³Ñ±â±â 
			}
			if(kbhit()) {
		    		clock_t start = clock();
		    		if( (clock() - start) / CLOCKS_PER_SEC > 2.0f ) 
		                break;
		        	black_input();			 
		            printf("\n   %s", key);
		            break;
		    }
		}
		if(i<0||i>15||j<97||i>110){
			printf("> ÆÇÀ» ¹þ¾î³µ¾î¿ä. ¹éµ¹ Â÷·Ê!");
			Sleep(1500);
			goto white; 
		}		
		if((arr[i-1][j-97] == 10) || (arr[i-1][j-97] == 11) || (arr[i-1][j-97] == 12) || (arr[i-1][j-97] == 13)){ //µ¹ÀÌ °ãÄ¥ ¶§ 
			printf("> µ¹Àº °ãÄ¥ ¼ö ¾ø¾î¿ä. ¹éµ¹ Â÷·Ê!\n   ");
			Sleep(1500);
			goto white; //Â÷·Ê ³Ñ±â±â 
		}
		else if(j=='o') arr[i-1][j-97] = 13;
		else arr[i-1][j-97] = 11;
		board();
		if((arr[i-1][j-97] == 11) && (arr[i-1][j-96] == 11) && (arr[i-1][j-95] == 11) && (arr[i-1][j-94] == 11) && ((arr[i-1][j-93] == 11) || (arr[i-1][j-93] == 13))){
			printf("Èæ½Â!");
			break;
		}
		else if((arr[i-1][j-97] == 11) && (arr[i-1][j-96] == 11) && (arr[i-1][j-95] == 11) && ((arr[i-1][j-94] == 11) || (arr[i-1][j-94] == 13)) && (arr[i-1][j-98] == 11)){
			printf("Èæ½Â!");
			break;
		}
		else if((arr[i-1][j-97] == 11) && (arr[i-1][j-96] == 11) && (arr[i-1][j-99] == 11) && ((arr[i-1][j-95] == 11) || (arr[i-1][j-95] == 13)) && (arr[i-1][j-98] == 11)){
			printf("Èæ½Â!");
			break;
		}	
		else if((arr[i-1][j-97] == 11) && (arr[i-1][j-100] == 11) && (arr[i-1][j-99] == 11) && ((arr[i-1][j-96] == 11) || (arr[i-1][j-96] == 13)) && (arr[i-1][j-98] == 11)){
			printf("Èæ½Â!");
			break;
		}
		else if((arr[i-1][j-101] == 11) && (arr[i-1][j-100] == 11) && (arr[i-1][j-99] == 11) && ((arr[i-1][j-97] == 11) || (arr[i-1][j-97] == 13)) && (arr[i-1][j-98] == 11)){
			printf("Èæ½Â!");
			break;
		}
		//Èæµ¹ ¿À¸¥ÂÊ À§ ´ë°¢¼± 
		else if((arr[i-1][j-97] == 11) && (arr[i-2][j-96] == 11) && (arr[i-3][j-95] == 11) && (arr[i-4][j-94] == 11) && ((arr[i-5][j-93] == 13) || (arr[i-5][j-93] == 11))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 4°³ 
			printf("Èæ½Â!");
			break; 
		}
		else if((arr[i][j-98] == 11) && (arr[i-1][j-97] == 11) && (arr[i-2][j-96] == 11) && (arr[i-3][j-95] == 11) && ((arr[i-4][j-94] == 13) || (arr[i-4][j-94] == 11))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 4°³ 
			printf("Èæ½Â!");
			break; 
		}
		else if((arr[i+1][j-99] == 11) && (arr[i][j-98] == 11) && (arr[i-1][j-97] == 11) && (arr[i-2][j-96] == 11) && ((arr[i-3][j-95] == 13) || (arr[i-3][j-95] == 11))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 4°³ 
			printf("Èæ½Â!");
			break; 
		}
		else if((arr[i+2][j-100] == 11) && (arr[i+1][j-99] == 11) && (arr[i][j-98] == 11) && (arr[i-1][j-97] == 11) && ((arr[i-2][j-96] == 13) || (arr[i-2][j-96] == 11))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 4°³ 
			printf("Èæ½Â!");
			break; 
		}
		else if((arr[i+3][j-101] == 11) && (arr[i+2][j-100] == 11) && (arr[i+1][j-99] == 11) && (arr[i][j-98] == 11) && ((arr[i-1][j-97] == 13) || (arr[i-1][j-97] == 11))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 4°³ 
			printf("Èæ½Â!");
			break; 
		}
		//Èæµ¹ ¿ÞÂÊ À§ ´ë°¢¼±  
		else if(((arr[i-1][j-97] == 11) || (arr[i-1][j-97] == 13)) && (arr[i-2][j-98] == 11) && (arr[i-3][j-99] == 11) && (arr[i-4][j-100] == 11) && (arr[i-5][j-101] == 11)){ //¿ÞÂÊ À§ ´ë°¢¼± 4°³ 
			printf("Èæ½Â!");
			break; 
		}
		else if(((arr[i][j-96] == 11) || (arr[i][j-96] == 13)) && (arr[i-2][j-98] == 11) && (arr[i-3][j-99] == 11) && (arr[i-4][j-100] == 11) && (arr[i-1][j-97] == 11)){ //¿ÞÂÊ À§ ´ë°¢¼± 3°³ 
			printf("Èæ½Â!");
			break; 
		}
		else if(((arr[i+1][j-95] == 11) || (arr[i+1][j-95] == 13)) && (arr[i][j-96] == 11) && (arr[i-1][j-97] == 11) && (arr[i-2][j-98] == 11) && (arr[i-3][j-99] == 11)){ //¿ÞÂÊ À§ ´ë°¢¼± 2°³ 
			printf("Èæ½Â!");
			break; 
		}
		else if(((arr[i+2][j-94] == 11) || (arr[i+2][j-94] == 13)) && (arr[i+1][j-95] == 11) && (arr[i][j-96] == 11) && (arr[i-1][j-97] == 11) && (arr[i-2][j-98] == 11)){ //¿ÞÂÊ À§ ´ë°¢¼± 1°³ 
			printf("Èæ½Â!");
			break; 
		}
		else if(((arr[i+3][j-93] == 11) || (arr[i+3][j-93] == 13)) && (arr[i+2][j-94] == 11) && (arr[i+1][j-95] == 11) && (arr[i][j-96] == 11) && (arr[i-1][j-97] == 11)){ //¿ÞÂÊ À§ ´ë°¢¼± 0°³ 
			printf("Èæ½Â!");
			break; 
		}
		//adfsdfasdfadfasdfasfasdsf
		else if(((arr[i-1][j-97] == 11) || (arr[i-1][j-97] == 13)) && ((arr[i-2][j-97] == 11) || (arr[i-2][j-97] == 13)) && ((arr[i-3][j-97] == 11) || (arr[i-3][j-97] == 13)) && ((arr[i-4][j-97] == 11) || (arr[i-4][j-97] == 13)) && ((arr[i-5][j-97] == 11) || (arr[i-5][j-97] == 13))){
			printf("Èæ½Â!");
			break;
		}		
		else if(((arr[i-1][j-97] == 11) || (arr[i-1][j-97] == 13)) && ((arr[i-2][j-97] == 11) || (arr[i-2][j-97] == 13)) && ((arr[i-3][j-97] == 11) || (arr[i-3][j-97] == 13)) && ((arr[i-4][j-97] == 11) || (arr[i-4][j-97] == 13)) && ((arr[i][j-97] == 11) || (arr[i][j-97] == 13))){
				printf("Èæ½Â!");
				break;
		}	
		else if(((arr[i-1][j-97] == 11) || (arr[i-1][j-97] == 13)) && ((arr[i-2][j-97] == 11) || (arr[i-2][j-97] == 13)) && ((arr[i-3][j-97] == 11) || (arr[i-3][j-97] == 13)) && ((arr[i+1][j-97] == 11) || (arr[i+1][j-97] == 13)) && ((arr[i][j-97] == 11) || (arr[i][j-97] == 13))){
				printf("Èæ½Â!");
				break;
		}			
		else if(((arr[i-1][j-97] == 11) || (arr[i-1][j-97] == 13)) && ((arr[i-2][j-97] == 11) || (arr[i-2][j-97] == 13)) && ((arr[i+2][j-97] == 11) || (arr[i+2][j-97] == 13)) && ((arr[i+1][j-97] == 11) || (arr[i+1][j-97] == 13)) && ((arr[i][j-97] == 11) || (arr[i][j-97] == 13))){
				printf("Èæ½Â!");
				break;
		}		
		else if(((arr[i-1][j-97] == 11) || (arr[i-1][j-97] == 13)) && ((arr[i+3][j-97] == 11) || (arr[i+3][j-97] == 13)) && ((arr[i+2][j-97] == 11) || (arr[i+2][j-97] == 13)) && ((arr[i+1][j-97] == 11) || (arr[i+1][j-97] == 13)) && ((arr[i][j-97] == 11) || (arr[i][j-97] == 13))){
				printf("Èæ½Â!");
				break;
		}
	white :
		sec = 0;
		while(TRUE){
			system("cls");
			board();
			printf("Time: %d\n", 30 - sec);
			printf("   white_input: ");
			sec++;
			Sleep(1000);
			if(sec == 30){
				printf("Time over");
				Sleep(1500);
				goto black;
			}
			if(kbhit()) {
		    		clock_t start = clock();
		    		if( (clock() - start) / CLOCKS_PER_SEC > 2.0f ) 
		                break;
		        	white_input();			 
		            printf("\n   %s", key);
		            break;
		    }
		}
		if(i<0||i>15||j<97||i>110){
			printf("> ÆÇÀ» ¹þ¾î³µ¾î¿ä. Èæµ¹ Â÷·Ê!");
			Sleep(1500);
			goto black; 
		}	
		if((arr[w-1][q-97] == 10) || (arr[w-1][q-97] == 11) || (arr[w-1][q-97] == 12) || (arr[w-1][q-97] == 13)){ //µ¹ÀÌ °ãÄ¥ ¶§ 
			printf("> µ¹Àº °ãÄ¥ ¼ö ¾ø¾î¿ä. Èæµ¹ Â÷·Ê!.\n   ");
			Sleep(1500);
			goto black; //Â÷·Ê ³Ñ±â±â 
		}
		if(q=='o') arr[w-1][q-97] = 12;
		else arr[w-1][q-97] = 10;		
		board();
		if((arr[w-1][q-97] == 10) && (arr[w-1][q-96] == 10) && (arr[w-1][q-95] == 10) && (arr[w-1][q-94] == 10) && ((arr[w-1][q-93] == 10) || (arr[w-1][q-93] == 12))){
			printf("Èæ½Â!");
			break;
		}
		else if((arr[w-1][q-97] == 10) && (arr[w-1][q-96] == 10) && (arr[w-1][q-95] == 10) && ((arr[w-1][q-94] == 10) || (arr[w-1][q-94] == 12)) && (arr[w-1][q-98] == 10)){
			printf("¹é½Â!");
			break;
		}
		else if((arr[w-1][q-97] == 10) && (arr[w-1][q-96] == 10) && (arr[w-1][q-99] == 10) && ((arr[w-1][q-95] == 10) || (arr[w-1][q-95] == 12)) && (arr[w-1][q-98] == 10)){
			printf("¹é½Â!");
			break;
		}	
		else if((arr[w-1][q-97] == 10) && (arr[w-1][q-100] == 10) && (arr[w-1][q-99] == 10) && ((arr[w-1][q-96] == 10) || (arr[w-1][q-96] == 12)) && (arr[w-1][q-98] == 10)){
			printf("¹é½Â!");
			break;
		}
		else if((arr[w-1][q-101] == 10) && (arr[w-1][q-100] == 10) && (arr[w-1][q-99] == 10) && ((arr[w-1][q-97] == 10) || (arr[w-1][q-97] == 12)) && (arr[w-1][q-98] == 10)){
			printf("¹é½Â!");
			break;
		}
		//¹éµ¹ ¿À¸¥ÂÊ À§ ´ë°¢¼± 
		else if((arr[w-1][q-97] == 10) && (arr[w-2][q-96] == 10) && (arr[w-3][q-95] == 10) && (arr[w-4][q-94] == 10) && ((arr[w-5][q-93] == 12) || (arr[w-5][q-93] == 10))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 4°³ 
			printf("¹é½Â!");
			break; 
		}
		else if((arr[w][q-98] == 10) && (arr[w-1][q-97] == 10) && (arr[w-2][q-96] == 10) && (arr[w-3][q-95] == 10) && ((arr[w-4][q-94] == 12) || (arr[w-4][q-94] == 10))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 3°³ 
			printf("¹é½Â!");
			break; 
		}
		else if((arr[w+1][q-99] == 10) && (arr[w][q-98] == 10) && (arr[w-1][q-97] == 10) && (arr[w-2][q-96] == 10) && ((arr[w-3][q-95] == 12) || (arr[w-3][q-95] == 10))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 2°³ 
			printf("¹é½Â!");
			break; 
		}
		else if((arr[w+2][q-100] == 10) && (arr[w+1][q-99] == 10) && (arr[w][q-98] == 10) && (arr[w-1][q-97] == 10) && ((arr[w-2][q-96] == 12) || (arr[w-2][q-96] == 10))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 1°³ 
			printf("¹é½Â!");
			break; 
		}
		else if((arr[w+3][q-101] == 10) && (arr[w+2][q-100] == 10) && (arr[w+1][q-99] == 10) && (arr[w][q-98] == 10) && ((arr[w-1][q-97] == 12) || (arr[w-1][q-97] == 10))){ //¿À¸¥ÂÊ À§ ´ë°¢¼± 0°³ 
			printf("¹é½Â!");
			break; 
		}
		//¹éµ¹ ¿ÞÂÊ À§ ´ë°¢¼± 
		else if((arr[w-1][q-97] == 10 || (arr[w-1][q-97] == 12)) && (arr[w-2][q-98] == 10) && (arr[w-3][q-99] == 10) && (arr[w-4][q-100] == 10) && (arr[w-5][q-101] == 10)) { //¿ÞÂÊ À§ ´ë°¢¼± 4°³ 
			printf("¹é½Â!");
			break; 
		}
		else if(((arr[w][q-96] == 10) || (arr[w][q-96] == 12)) && (arr[w-2][q-98] == 10) && (arr[w-3][q-99] == 10) && (arr[w-4][q-100] == 10) && (arr[w-1][q-97] == 10)){ //¿ÞÂÊ À§ ´ë°¢¼± 3°³ 
			printf("¹é½Â!");
			break;
		}
		else if(((arr[w+1][q-95] == 10) || (arr[w+1][q-95] == 12)) && (arr[w][q-96] == 10) && (arr[w-1][q-97] == 10) && (arr[w-2][q-98] == 10) && (arr[w-3][q-99] == 10)){ //¿ÞÂÊ À§ ´ë°¢¼± 2°³ 
			printf("¹é½Â!");
			break;
		}
		else if(((arr[w+2][q-94] == 10) || (arr[w+2][q-94] == 12)) && (arr[w+1][q-95] == 10) && (arr[w][q-96] == 10) && (arr[w-1][q-97] == 10) && (arr[w-2][q-98] == 10)){ //¿ÞÂÊ À§ ´ë°¢¼± 1°³ 
			printf("º¤½Â!");
			break;
		}
		else if(((arr[w+3][q-93] == 10) || (arr[w+3][q-93] == 12)) && (arr[w+2][q-94] == 10) && (arr[w+1][q-95] == 10) && (arr[w][q-96] == 10) && (arr[w-1][q-97] == 10)){ //¿ÞÂÊ À§ ´ë°¢¼± 0°³ 
			printf("¹é½Â!");
			break; 
		}
		else if(((arr[w-1][q-97] == 10) || (arr[w-1][q-97] == 12)) && ((arr[w-2][q-97] == 10) || (arr[w-2][q-97] == 12)) && ((arr[w-3][q-97] == 10) || (arr[w-3][q-97] == 12)) && ((arr[w-4][q-97] == 10) || (arr[w-4][q-97] == 12)) && ((arr[w-5][q-97] == 10) || (arr[w-5][q-97] == 12))){
			printf("¹é½Â!");
			break;
		}		
		else if(((arr[w-1][q-97] == 10) || (arr[w-1][q-97] == 12)) && ((arr[w-2][q-97] == 10) || (arr[w-2][q-97] == 12)) && ((arr[w-3][q-97] == 10) || (arr[w-3][q-97] == 12)) && ((arr[w-4][q-97] == 10) || (arr[w-4][q-97] == 12)) && ((arr[w][q-97] == 10) || (arr[w][q-97] == 12))){
				printf("¹é½Â!");
				break;
		}	
		else if(((arr[w-1][q-97] == 10) || (arr[w-1][q-97] == 12)) && ((arr[w-2][q-97] == 10) || (arr[w-2][q-97] == 12)) && ((arr[w-3][q-97] == 10) || (arr[w-3][q-97] == 12)) && ((arr[w+1][q-97] == 10) || (arr[w+1][q-97] == 12)) && ((arr[w][q-97] == 10) || (arr[w][q-97] == 12))){
				printf("¹é½Â!");
				break;
		}			
		else if(((arr[w-1][q-97] == 10) || (arr[w-1][q-97] == 12)) && ((arr[w-2][q-97] == 10) || (arr[w-2][q-97] == 12)) && ((arr[w+2][q-97] == 10) || (arr[w+2][q-97] == 12)) && ((arr[w+1][q-97] == 10) || (arr[w+1][q-97] == 12)) && ((arr[w][q-97] == 10) || (arr[w][q-97] == 12))){
				printf("¹é½Â!");
				break;
		}		
		else if(((arr[w-1][q-97] == 10) || (arr[w-1][q-97] == 12)) && ((arr[w+3][q-97] == 10) || (arr[w+3][q-97] == 12)) && ((arr[w+2][q-97] == 10) || (arr[w+2][q-97] == 12)) && ((arr[w+1][q-97] == 10) || (arr[w+1][q-97] == 12)) && ((arr[w][q-97] == 10) || (arr[w][q-97] == 12))){
				printf("¹é½Â!");
				break;
		}
	}
	return 0;
}

